ЕРПУХАстенд.cbr_Основной/src/Documents/УпаковочныйЛист/УпаковочныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0b5dd848-f150-4ea5-a88e-a87ad708a9b9">
  <name>УпаковочныйЛист</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>cbr_КоличествоПаллет</name>
    <comment>//cbr-larkovgeorg 10.02.2026 СКЛ.12</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_Контрагент</name>
    <comment>//cbr-larkovgeorg 25.02.2026 СКЛ.12 </comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="137118f7-2a9a-4617-98b9-d1d8ca93edf4">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>cbr_НомерПаллета</name>
      <comment>//cbr-larkovgeorg 10.02.2026 СКЛ.12</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>cbr_Уровень</name>
      <comment>//cbr-larkovgeorg 10.02.2026 СКЛ.12</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>cbr_Паллет</name>
      <comment>//cbr-larkovgeorg 19.02.2026 СКЛ.12</comment>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Catalogs/cbr_ПредопределенныеЗначенияКонстант/cbr_ПредопределенныеЗначенияКонстант.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>cbr_ПредопределенныеЗначенияКонстант</name>
  <comment>//cbr-larkovgeorg 15.02.2026 СКЛ.12(по указанию архитектора)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НаборУпаковокПаллеты</name>
    </items>
    <items>
      <name>ВыходнойКонтроль</name>
    </items>
    <items>
      <name>СпецификацияДействует</name>
    </items>
    <items>
      <name>РольОтветственныйЗаСпецификации</name>
    </items>
    <items>
      <name>ЕвроПаллет</name>
      <description>Евро паллет</description>
    </items>
    <items>
      <name>АмерПаллет</name>
      <description>Амер паллет</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.НаборыУпаковок</types>
      <types>String</types>
      <types>EnumRef.СтатусыСпецификаций</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ЕРПУХАстенд.cbr_Основной/src/Documents/УпаковочныйЛист/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&После("ПриСозданииНаСервере")
&НаСервере
Процедура cbr_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++ cbr-larkovgeorg 10.02.2026 СКЛ.12

	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);		
	
	//-- cbr-larkovgeorg 10.02.2026 СКЛ.12
КонецПроцедуры

&После("ОбработкаПроверкиЗаполненияНаСервере")
&НаСервере
Процедура cbr_ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	//++ cbr-larkovgeorg 10.02.2026 СКЛ.12
	Для Каждого Строка Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Строка.cbr_НомерПаллета) И Не ЗначениеЗаполнено(Строка.cbr_Уровень) Тогда

			Отказ = Истина;
			Сообщение = СтрШаблон("В строке %1 не заполнено колонка «Уровень»!", Строка.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(Сообщение);

		КонецЕсли;
	КонецЦикла;
	//-- cbr-larkovgeorg 10.02.2026 СКЛ.12
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура cbr_РасставитьПродукциюПоПаллетам(Команда)
	
	//++ cbr-larkovgeorg 10.02.2026 СКЛ.12
	ИндексыВыделенныхСтрок = Новый Массив;
	Для Каждого Строка Из Элементы.Товары.ВыделенныеСтроки Цикл
		НайденнаяСтрока = Объект.Товары.НайтиПоИдентификатору(Строка);
		Индекс = НайденнаяСтрока.НомерСтроки - 1;
		ИндексыВыделенныхСтрок.Добавить(Индекс);
	КонецЦикла;

	Если ИндексыВыделенныхСтрок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выделите строки для расстановки на паллеты!");
	Иначе
		cbr_РасставитьПродукциюПоПаллетамНаСервере(ИндексыВыделенныхСтрок);
		Модифицированность = Истина;
	КонецЕсли;
	
	//-- cbr-larkovgeorg 10.02.2026 СКЛ.12	

КонецПроцедуры

&НаКлиенте
Процедура cbr_НомерПаллетаПриИзменении(Элемент)

	//++ cbr-larkovgeorg 10.02.2026 СКЛ.12
	Объект.cbr_КоличествоПаллет = cbr_МаксимальныйНомерПаллетаВДокументе();

КонецПроцедуры //-- cbr-larkovgeorg 10.02.2026 СКЛ.12

&НаСервере
Функция cbr_МаксимальныйНомерПаллетаВДокументе()
	//++ cbr-larkovgeorg 15.02.2026 СКЛ.12
	НомераПаллетов = Объект.Товары.Выгрузить( , "cbr_НомерПаллета");
	НомераПаллетов.Сортировать("cbr_НомерПаллета УБЫВ");
	МаксимальныйНомерПаллета = НомераПаллетов[0].cbr_НомерПаллета;
	Возврат МаксимальныйНомерПаллета
КонецФункции //-- cbr-larkovgeorg 15.02.2026 СКЛ.12

&НаСервере
Функция cbr_МаксимальныйУровеньТаблицы(ТаблицаТоваров)
	//++ cbr-larkovgeorg 17.02.2026 СКЛ.12
	МаксимальныйУровень = 0;

	Если ТипЗнч(ТаблицаТоваров) = Тип("ТаблицаЗначений") Тогда
		ТаблицаПоиска = ТаблицаТоваров.Скопировать();
		ТаблицаПоиска.Сортировать("cbr_Уровень УБЫВ");
		МаксимальныйУровень = ТаблицаПоиска[0].cbr_Уровень;
	КонецЕсли;

	Возврат МаксимальныйУровень
КонецФункции//-- cbr-larkovgeorg 17.02.2026 СКЛ.12

&НаСервере
Процедура cbr_РасставитьПродукциюПоПаллетамНаСервере(ВыбранныеСтроки)
	//++ cbr-larkovgeorg 25.02.26 СКЛ.12

	ТаблицаДокумента   = Объект.Товары.Выгрузить();
	ТаблицаДокумента.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));

	Упаковки = ТаблицаДокумента.ВыгрузитьКолонку("Упаковка");
	Наборы = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Упаковки,
		"Владелец, cbr_СвойствоУпаковки, Вес, Высота, Глубина, Ширина");
	ЗначениеПаллетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		Справочники.cbr_ПредопределенныеЗначенияКонстант.НаборУпаковокПаллеты, "Значение");
	ЕвроПаллет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		Справочники.cbr_ПредопределенныеЗначенияКонстант.ЕвроПаллет, "Значение");
	АмерикаПаллет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		Справочники.cbr_ПредопределенныеЗначенияКонстант.АмерПаллет, "Значение");	
	РеквизитыПаллетаЕвро = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ЕвроПаллет, "Высота, Глубина, Ширина, Вес");

	ИтоговаяТаблица = Новый ТаблицаЗначений;
	ИтоговаяТаблица = ТаблицаДокумента.СкопироватьКолонки();
	ИтоговаяТаблица.Колонки.Добавить("cbr_СвойствоУпаковки", Новый ОписаниеТипов("Число"));
	ИтоговаяТаблица.Колонки.Добавить("Вес", Новый ОписаниеТипов("Число"));
	ИтоговаяТаблица.Колонки.Добавить("Высота", Новый ОписаниеТипов("Число"));
	ИтоговаяТаблица.Колонки.Добавить("Глубина", Новый ОписаниеТипов("Число"));
	ИтоговаяТаблица.Колонки.Добавить("Ширина", Новый ОписаниеТипов("Число"));

	ОставленныеСтрокиТЧ = ТаблицаДокумента.Скопировать();
	ОставленныеСтрокиТЧ.Очистить();

	ТаблицаОтложенных = ИтоговаяТаблица.Скопировать();
	ТаблицаОтложенных.Очистить();

	Для Каждого ИндексСтроки Из ВыбранныеСтроки Цикл

		СтруктураНабора = Наборы.Получить(ТаблицаДокумента[ИндексСтроки].Упаковка);
		Если ТаблицаДокумента[ИндексСтроки].Упаковка <> Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка()
			И СтруктураНабора.Владелец <> ЗначениеПаллетов И ЗначениеЗаполнено(СтруктураНабора.cbr_СвойствоУпаковки)
			И ЗначениеЗаполнено(СтруктураНабора.Вес) И ТаблицаДокумента[ИндексСтроки].cbr_Уровень = 0
			И ТаблицаДокумента[ИндексСтроки].cbr_НомерПаллета = 0 И ТаблицаДокумента[ИндексСтроки].cbr_Паллет
			= Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
			СтрокаТЗ = ИтоговаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, ТаблицаДокумента[ИндексСтроки]);
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтруктураНабора);
			ТаблицаДокумента[ИндексСтроки].Используется = Истина;
		Иначе
			ОставленнаяСтрока = ОставленныеСтрокиТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(ОставленнаяСтрока, ТаблицаДокумента[ИндексСтроки]);
			ТаблицаДокумента[ИндексСтроки].Используется = Истина;
		КонецЕсли;

	КонецЦикла;

	Для Каждого СтрокаТовара Из ТаблицаДокумента Цикл
		Если Не СтрокаТовара.Используется Тогда
			ОставленнаяСтрока = ОставленныеСтрокиТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(ОставленнаяСтрока, СтрокаТовара);
		КонецЕсли;
	КонецЦикла;

	Если ИтоговаяТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ИтоговаяТаблица.Свернуть(
		"cbr_НомерПаллета, cbr_СвойствоУпаковки, cbr_Паллет, cbr_Уровень, Артикул, Вес, Высота, Глубина, Комментарий, Назначение, Номенклатура, НоменклатураПартнера, Серия, СтатусУказанияСерий, ТипНоменклатуры, Упаковка, УпаковочныйЛист, УпаковочныйЛистДата, УпаковочныйЛистКод, УпаковочныйЛистРодитель, УпаковочныйЛистРодительКод, Характеристика, ХарактеристикиИспользуются, Ширина, ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста, ЭтоУпаковочныйЛист",
		"КоличествоУпаковок, Количество");
	ИтоговаяТаблица.Сортировать("cbr_СвойствоУпаковки Возр, Вес Убыв");

	МаксимальныйНомерПаллета = cbr_МаксимальныйНомерПаллетаВДокументе();
	МаксимальныйНомерПаллета = МаксимальныйНомерПаллета + 1;

	ПерваяПродукцияУровня = Новый Соответствие;
	МаксимальныеВысотыУровней = Новый Соответствие;
	
	ОстатокПлощадиПаллетаЕвро = РеквизитыПаллетаЕвро.Глубина * РеквизитыПаллетаЕвро.Ширина;
	ОстатокВесаПаллетаЕвро = РеквизитыПаллетаЕвро.Вес;
	ОстатокВысотыПаллетаЕвро = РеквизитыПаллетаЕвро.Высота;

	Уровень = 0;
	ПоследнийУровеньПаллета = 0;
	ПлощадьПервогоУровня = 0;
	
	//Основной цикл
	Пока ИтоговаяТаблица.Количество() > 0 Цикл

		Если Уровень = 9 Тогда
			Уровень = 0;
			ПоследнийУровеньПаллета = 0;
			МаксимальныйНомерПаллета = МаксимальныйНомерПаллета + 1;
			ПлощадьПервогоУровня = 0;

			ОстатокВесаПаллетаЕвро = РеквизитыПаллетаЕвро.Вес;
			ОстатокВысотыПаллетаЕвро = РеквизитыПаллетаЕвро.Высота;

		КонецЕсли;

		Уровень = Уровень + 1;

		ОстатокПлощадиПаллетаЕвро = РеквизитыПаллетаЕвро.Глубина * РеквизитыПаллетаЕвро.Ширина;
		
		Если Уровень <> 1 Тогда
			
		КонецЕсли;
		МаксимальнаяВысотаУровня = 0;
		Для Каждого СтрокаТаблицы Из ИтоговаяТаблица Цикл

			ИтоговаяТаблица.Сортировать("cbr_СвойствоУпаковки Возр, Вес Убыв");
			Уровни = ИтоговаяТаблица.ВыгрузитьКолонку("cbr_СвойствоУпаковки");
			ДевятьНельзяПоложить = Ложь;

			Если СтрокаТаблицы.cbr_СвойствоУпаковки = 1 И Уровень <> 1 Тогда
				Продолжить;
			ИначеЕсли СтрокаТаблицы.cbr_СвойствоУпаковки <> 1 И Уровень = 1 Тогда
				Продолжить;
			ИначеЕсли СтрокаТаблицы.cbr_СвойствоУпаковки = 9 И Уровень <> 1 Тогда

				Для Счетчик = 0 По 7 Цикл
					Счетчик = Счетчик + 1;

					Если Уровни.Найти(Счетчик) <> Неопределено Тогда
						ДевятьНельзяПоложить = Истина;
						Прервать;
					КонецЕсли;

				КонецЦикла;

				Если ДевятьНельзяПоложить Тогда
					Продолжить;
				КонецЕсли;

			КонецЕсли;

			ПлощадьУпаковки = СтрокаТаблицы.Глубина * СтрокаТаблицы.Ширина;
			ВесУпаковки = СтрокаТаблицы.Вес;
			ВысотаУпаковки = СтрокаТаблицы.Высота;

			ПлощадьУпаковок = ПлощадьУпаковки * СтрокаТаблицы.КоличествоУпаковок;
			ВесУпаковок = ВесУпаковки * СтрокаТаблицы.КоличествоУпаковок;

			ПлощадьУпаковокПоложенная = ПлощадьУпаковок;
			ВесУпаковокПоложенный = ВесУпаковок;
			КоличествоНачальное = СтрокаТаблицы.КоличествоУпаковок;

			Если СтрокаТаблицы.cbr_Уровень = 0 И СтрокаТаблицы.cbr_НомерПаллета = 0
				И СтрокаТаблицы.cbr_СвойствоУпаковки = 1 Тогда
				
				СтрокаТаблицы.cbr_НомерПаллета = МаксимальныйНомерПаллета;

				Если Уровень - ПоследнийУровеньПаллета > 1 Тогда
					СтрокаТаблицы.cbr_Уровень = ПоследнийУровеньПаллета + 1;
				Иначе
					СтрокаТаблицы.cbr_Уровень = Уровень;
				КонецЕсли;

				ПоследнийУровеньПаллета = СтрокаТаблицы.cbr_Уровень;
				
				Если СтрокаТаблицы.КоличествоУпаковок / 3 >= 1 Тогда
					
					СтрокаТаблицы.cbr_Паллет = АмерикаПаллет;	

					Если СтрокаТаблицы.КоличествоУпаковок = 3 Или СтрокаТаблицы.КоличествоУпаковок = 4 Тогда

						СтрокаОтложенной = ТаблицаОтложенных.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаОтложенной, СтрокаТаблицы);
						Прервать;

					Иначе

						СтрокаИтоговой = ИтоговаяТаблица.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаИтоговой, СтрокаТаблицы);
						СтрокаИтоговой.КоличествоУпаковок = СтрокаИтоговой.КоличествоУпаковок - 4;

						СтрокаОтложенной = ТаблицаОтложенных.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаОтложенной, СтрокаТаблицы);
						СтрокаОтложенной.КоличествоУпаковок = 4;
						Прервать;

					КонецЕсли;
					
				Иначе
					
					СтрокаТаблицы.cbr_Паллет = ЕвроПаллет;
					
					ПлощадьПервогоУровня = 	ПлощадьПервогоУровня + ПлощадьУпаковокПоложенная;
					
					СтрокаОтложенной = ТаблицаОтложенных.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаОтложенной, СтрокаТаблицы);
					Продолжить;

				КонецЕсли;

			ИначеЕсли СтрокаТаблицы.cbr_Уровень = 0 И СтрокаТаблицы.cbr_НомерПаллета = 0 И ПлощадьУпаковки
				<= ОстатокПлощадиПаллетаЕвро И ВесУпаковки <= ОстатокВесаПаллетаЕвро Тогда

				Если МаксимальнаяВысотаУровня < ВысотаУпаковки Тогда
					МаксимальнаяВысотаУровня = СтрокаТаблицы.Высота;
					МаксимальныеВысотыУровней.Вставить(Строка(МаксимальныйНомерПаллета) + "." + Строка(Уровень),
						МаксимальнаяВысотаУровня);
				КонецЕсли;
				
				СтрокаТаблицы.КоличествоУпаковок = Цел(ОстатокПлощадиПаллетаЕвро/ПлощадьУпаковки);
				ВесУпаковокПоложенный = ВесУпаковки * СтрокаТаблицы.КоличествоУпаковок;
				ПлощадьУпаковокПоложенная = ПлощадьУпаковки * СтрокаТаблицы.КоличествоУпаковок;

				Пока ВесУпаковокПоложенный >= ОстатокВесаПаллетаЕвро Цикл

					Если ПерваяПродукцияУровня.Получить(Уровень) <> Неопределено Тогда
						ИндексСтроки = ИтоговаяТаблица.Индекс(СтрокаТаблицы);
						ИтоговаяТаблица.Сдвинуть(ИндексСтроки, ИтоговаяТаблица.Количество() - (ИндексСтроки + 1));
						ОстатокВысотыПаллетаЕвро = ОстатокВысотыПаллетаЕвро - МаксимальнаяВысотаУровня;

						ИтоговаяТаблица.Свернуть(
							"cbr_НомерПаллета, cbr_СвойствоУпаковки, cbr_Паллет, cbr_Уровень, Артикул, Вес, Высота, Глубина, Комментарий, Назначение, Номенклатура, НоменклатураПартнера, Серия, СтатусУказанияСерий, ТипНоменклатуры, Упаковка, УпаковочныйЛист, УпаковочныйЛистДата, УпаковочныйЛистКод, УпаковочныйЛистРодитель, УпаковочныйЛистРодительКод, Характеристика, ХарактеристикиИспользуются, Ширина, ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста, ЭтоУпаковочныйЛист",
							"КоличествоУпаковок, Количество");
						Прервать;
					КонецЕсли;

					ПлощадьУпаковокПоложенная = ПлощадьУпаковокПоложенная - ПлощадьУпаковки;
					ВесУпаковокПоложенный = ВесУпаковокПоложенный - ВесУпаковки;
					СтрокаТаблицы.КоличествоУпаковок = СтрокаТаблицы.КоличествоУпаковок - 1;
				КонецЦикла;

				Если Уровень <> 1 И СтрокаТаблицы.cbr_СвойствоУпаковки <> 1 И ОстатокВысотыПаллетаЕвро
					< МаксимальнаяВысотаУровня Тогда
					ИндексСтроки = ИтоговаяТаблица.Индекс(СтрокаТаблицы);
					ИтоговаяТаблица.Сдвинуть(ИндексСтроки, ИтоговаяТаблица.Количество() - (ИндексСтроки + 1));

					ИтоговаяТаблица.Свернуть(
						"cbr_НомерПаллета, cbr_СвойствоУпаковки, cbr_Паллет ,cbr_Уровень, Артикул, Вес, Высота, Глубина, Комментарий, Назначение, Номенклатура, НоменклатураПартнера, Серия, СтатусУказанияСерий, ТипНоменклатуры, Упаковка, УпаковочныйЛист, УпаковочныйЛистДата, УпаковочныйЛистКод, УпаковочныйЛистРодитель, УпаковочныйЛистРодительКод, Характеристика, ХарактеристикиИспользуются, Ширина, ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста, ЭтоУпаковочныйЛист",
						"КоличествоУпаковок, Количество");
					Прервать;
				КонецЕсли;

				ПерваяПродукцияУровня.Вставить(Строка(МаксимальныйНомерПаллета) + "." + Строка(Уровень),
					СтрокаТаблицы.Номенклатура);

				СтрокаТаблицы.cbr_НомерПаллета = МаксимальныйНомерПаллета;

				Если Уровень - ПоследнийУровеньПаллета > 1 Тогда
					СтрокаТаблицы.cbr_Уровень = ПоследнийУровеньПаллета + 1;
				Иначе
					СтрокаТаблицы.cbr_Уровень = Уровень;
				КонецЕсли;

				ПоследнийУровеньПаллета = СтрокаТаблицы.cbr_Уровень;

				СтрокаТаблицы.cbr_Паллет = ЕвроПаллет;

				СтрокаОтложенной = ТаблицаОтложенных.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаОтложенной, СтрокаТаблицы);
				ОстатокПлощадиПаллетаЕвро = ОстатокПлощадиПаллетаЕвро - ПлощадьУпаковокПоложенная;
				ОстатокВесаПаллетаЕвро = ОстатокВесаПаллетаЕвро - ВесУпаковокПоложенный;

				Если КоличествоНачальное > СтрокаТаблицы.КоличествоУпаковок Тогда
					КоличествоОсталось = КоличествоНачальное - СтрокаТаблицы.КоличествоУпаковок;

					СтрокаОстатка = ИтоговаяТаблица.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаОстатка, СтрокаТаблицы);
					СтрокаОстатка.cbr_НомерПаллета = 0;
					СтрокаОстатка.cbr_Уровень = 0;
					СтрокаОстатка.КоличествоУпаковок  = КоличествоОсталось;
					ИтоговаяТаблица.Свернуть(
						"cbr_НомерПаллета, cbr_СвойствоУпаковки, cbr_Паллет,cbr_Уровень, Артикул, Вес, Высота, Глубина, Комментарий, Назначение, Номенклатура, НоменклатураПартнера, Серия, СтатусУказанияСерий, ТипНоменклатуры, Упаковка, УпаковочныйЛист, УпаковочныйЛистДата, УпаковочныйЛистКод, УпаковочныйЛистРодитель, УпаковочныйЛистРодительКод, Характеристика, ХарактеристикиИспользуются, Ширина, ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста, ЭтоУпаковочныйЛист",
						"КоличествоУпаковок, Количество");

					ОстатокВысотыПаллетаЕвро = ОстатокВысотыПаллетаЕвро - МаксимальнаяВысотаУровня;
					Прервать;

				КонецЕсли;
			ИначеЕсли (СтрокаТаблицы.cbr_Уровень = 0 И СтрокаТаблицы.cbr_НомерПаллета = 0) И (ПлощадьУпаковки
				> ОстатокПлощадиПаллетаЕвро Или ВесУпаковки > ОстатокВесаПаллетаЕвро) Тогда

				ИндексСтроки = ИтоговаяТаблица.Индекс(СтрокаТаблицы);

				Если ПлощадьУпаковки >= ОстатокПлощадиПаллетаЕвро И ОстатокПлощадиПаллетаЕвро
					= РеквизитыПаллетаЕвро.Глубина * РеквизитыПаллетаЕвро.Ширина Тогда
					ИтоговаяТаблица.Удалить(ИндексСтроки);
				ИначеЕсли ВесУпаковки >= ОстатокВесаПаллетаЕвро И ОстатокВесаПаллетаЕвро = РеквизитыПаллетаЕвро.Вес Тогда
					ИтоговаяТаблица.Удалить(ИндексСтроки);
				Иначе
					ИтоговаяТаблица.Сдвинуть(ИндексСтроки, ИтоговаяТаблица.Количество() - (ИндексСтроки + 1));
				КонецЕсли;

				ИтоговаяТаблица.Свернуть(
					"cbr_НомерПаллета, cbr_СвойствоУпаковки, cbr_Уровень, cbr_Паллет, Артикул, Вес, Высота, Глубина, Комментарий, Назначение, Номенклатура, НоменклатураПартнера, Серия, СтатусУказанияСерий, ТипНоменклатуры, Упаковка, УпаковочныйЛист, УпаковочныйЛистДата, УпаковочныйЛистКод, УпаковочныйЛистРодитель, УпаковочныйЛистРодительКод, Характеристика, ХарактеристикиИспользуются, Ширина, ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста, ЭтоУпаковочныйЛист",
					"КоличествоУпаковок, Количество");
				ОстатокВысотыПаллетаЕвро = ОстатокВысотыПаллетаЕвро - МаксимальнаяВысотаУровня;

				Прервать;

			Иначе

				Продолжить;

			КонецЕсли;
		КонецЦикла;

		Счетчик = ИтоговаяТаблица.Количество();
		Пока Счетчик > 0 Цикл
			Счетчик = Счетчик - 1;

			Если ИтоговаяТаблица[Счетчик].cbr_Уровень <> 0 Или ИтоговаяТаблица[Счетчик].cbr_НомерПаллета <> 0 Тогда
				ИтоговаяТаблица.Удалить(Счетчик);
			КонецЕсли;
		КонецЦикла;

	КонецЦикла;
	
	//Формирование табличной части

	Объект.Товары.Очистить();
	ТаблицаОтложенных.Свернуть(
		"cbr_НомерПаллета, cbr_СвойствоУпаковки, cbr_Уровень, cbr_Паллет, Артикул, Вес, Высота, Глубина, Комментарий, Назначение, Номенклатура, НоменклатураПартнера, Серия, СтатусУказанияСерий, ТипНоменклатуры, Упаковка, УпаковочныйЛист, УпаковочныйЛистДата, УпаковочныйЛистКод, УпаковочныйЛистРодитель, УпаковочныйЛистРодительКод, Характеристика, ХарактеристикиИспользуются, Ширина, ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста, ЭтоУпаковочныйЛист",
		"КоличествоУпаковок, Количество");

	ТаблицаОтложенных.Колонки.Добавить("НомерСтроки");
	ТаблицаОтложенных.Колонки.Добавить("НомерСтрокиОтображаемый");
	ТаблицаОтложенных.Колонки.Добавить("ИсходныйНомерСтроки");

	Для Каждого ТоварОставшийся Из ОставленныеСтрокиТЧ Цикл
		Строка = ТаблицаОтложенных.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ТоварОставшийся);
	КонецЦикла;

	ТаблицаОтложенных.Сортировать(" cbr_Паллет Возр, cbr_НомерПаллета Возр, cbr_Уровень Возр");

	Счетчик = ТаблицаОтложенных.Количество();
	Пока Счетчик > 0 Цикл
		Счетчик = Счетчик - 1;
		Если ТаблицаОтложенных[Счетчик].cbr_НомерПаллета = 0 Или ТаблицаОтложенных[Счетчик].cbr_Уровень = 0 Тогда
			ТаблицаОтложенных.Сдвинуть(Счетчик, ТаблицаОтложенных.Количество() - Счетчик - 1);
		КонецЕсли;
	КонецЦикла;

	Счетчик = 0;
	Для Каждого Товар Из ТаблицаОтложенных Цикл
		Счетчик = Счетчик + 1;
		Товар.НомерСтроки = Счетчик;
		Товар.НомерСтрокиОтображаемый = Счетчик;
		Товар.ИсходныйНомерСтроки = Счетчик;
	КонецЦикла;

	Объект.Товары.Загрузить(ТаблицаОтложенных);

	Объект.cbr_КоличествоПаллет = МаксимальныйНомерПаллета;
	ОбщегоНазначения.СообщитьПользователю("Вся продукция расставлена по паллетам.");

КонецПроцедуры //-- cbr-larkovgeorg 25.02.26 СКЛ.12
#КонецОбласти
